# 测试 `file_Tool`

In [5]:
%%capture
%run "file_Tool.ipynb"

# 测试 `Text`

In [2]:
L = [1 , '222' , 3.0 , [1 , '222' , 3.0]]

In [3]:
# 直接覆盖，可重复运行

cover_txt(L , r'data\直接覆盖.txt')

文件存在，直接覆盖 'data\直接覆盖.txt'

In [4]:
# 末尾追加，可重复运行

append_txt(L , r'data\末尾追加.txt')

文件存在，末尾追加 'data\末尾追加.txt'

In [5]:
# 读取

lines = read_txt(r'data\末尾追加.txt')
for line in lines:
    print(line)

1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
\n\n\n\n\n\n
3.0
[1, '222', 3.0]
-----追加-----
1\r
222\n\n\n\n\n\n\n\n\n\n\n
3.0\t
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]
-----追加-----
1
222
3.0
[1, '222', 3.0]

# 测试 `Excel`

## 单 sheet
>- 注意：`List`  ==>  存储  ==>  Excel  ==>  读取  ==> `String`（详见 `file_Tool_Test.ipynb`）

In [6]:
data = pd.DataFrame({'One' : ['A' , 'B' , [1 , '2' , 3.0]] , 'Two' : [1 , 2 , 3]} , index = ['X' , 'Y' , 'Z'])
print(data.iloc[2]['One'])
print(type(data.iloc[2]['One']))
data

[1, '2', 3.0]
<class 'list'>

           One  Two
X            A    1
Y            B    2
Z  [1, 2, 3.0]    3

In [7]:
# 直接覆盖，可重复运行

save_ex(data , r'data\直接覆盖.xlsx')

文件存在，直接覆盖 'data\直接覆盖.xlsx'

In [8]:
# 读取
# List 已经变为 String 数据类型

data = read_ex(r'data\直接覆盖.xlsx')
print(data.iloc[2]['One'])
print(type(data.iloc[2]['One']))
data

[1, '2', 3.0]
<class 'str'>

  Index            One  Two
0     X              A    1
1     Y              B    2
2     Z  [1, '2', 3.0]    3

In [9]:
# 重置行索引

data = data.set_index('Index')
data

                 One  Two
Index
X                  A    1
Y                  B    2
Z      [1, '2', 3.0]    3

## 多 sheet

In [10]:
# 读取所有的 sheetName

read_all_sheets(r'data\直接覆盖.xlsx')

['Sheet1']

In [11]:
# 读取指定 sheetName 的数据

read_ex_sheet(r'data\直接覆盖.xlsx' , 'Sheet1')

  Index            One  Two
0     X              A    1
1     Y              B    2
2     Z  [1, '2', 3.0]    3

# 测试 `Json`

In [12]:
data = pd.DataFrame({'One' : ['A' , 'B' , [1 , '2' , 3.0]] , 'Two' : [1 , 2 , 3]} , index = ['X' , 'Y' , 'Z'])
print(data.iloc[2]['One'])
print(type(data.iloc[2]['One']))
data

[1, '2', 3.0]
<class 'list'>

           One  Two
X            A    1
Y            B    2
Z  [1, 2, 3.0]    3

In [13]:
# 直接覆盖，可重复运行

save_json(data , r'data\直接覆盖.json')

文件存在，直接覆盖 'data\直接覆盖.json'

In [14]:
# 读取
# 依旧保持 List 数据类型

data = read_json(r'data\直接覆盖.json')
print(data.iloc[2]['One'])
print(type(data.iloc[2]['One']))
data

[1, '2', 3.0]
<class 'list'>

           One  Two
0            A    1
1            B    2
2  [1, 2, 3.0]    3

# 测试数据类型

## 从 `.xlsx` 中读取
>- 详见 `README_Soft` 的 `WPS`

In [15]:
data = read_ex(r'data\Python 读取 Excel 文件.xlsx')

In [16]:
data.dtypes

日期一           datetime64[ns]
日期二           datetime64[ns]
日期三           datetime64[ns]
Number 数值              int64
Decimal 数值           float64
Str 字符串               object
dtype: object

In [17]:
cols = allCol(data)

(10 行 ,  6 列)

           列名                                      数据类型  NaN 个数  NaN 占比
0         日期一  pandas._libs.tslibs.timestamps.Timestamp       0   0.00%
1         日期二  pandas._libs.tslibs.timestamps.Timestamp       0   0.00%
2         日期三  pandas._libs.tslibs.timestamps.Timestamp       0   0.00%
3   Number 数值                               numpy.int64       0   0.00%
4  Decimal 数值                             numpy.float64       0   0.00%
5     Str 字符串                                       str       0   0.00%

In [18]:
allCol_simple(data)

[pandas._libs.tslibs.timestamps.Timestamp,
 pandas._libs.tslibs.timestamps.Timestamp,
 pandas._libs.tslibs.timestamps.Timestamp,
 numpy.int64,
 numpy.float64,
 str]

In [19]:
str in allCol_simple(data)

True

In [20]:
np.int64 in allCol_simple(data)

True

In [21]:
pd._libs.tslibs.timestamps.Timestamp in allCol_simple(data)

True

In [22]:
data

         日期一        日期二        日期三  Number 数值   Decimal 数值         Str 字符串
0 2022-07-25 2022-07-25 2022-07-25          1     -1.45230              我；
1 2022-07-26 2022-07-26 2022-07-26      -4523    439.70300              你。
2 2022-07-27 2022-07-27 2022-07-27          3      5.64000              他！
3 2022-07-28 2022-07-28 2022-07-28    7435431   1234.58000              她？
4 2022-07-29 2022-07-29 2022-07-29       -543     -3.14159            它￥￥￥
5 2022-07-30 2022-07-30 2022-07-30          3      0.90100           *&#……
6 2022-07-31 2022-07-31 2022-07-31      -4178     99.10100  Achilles Prime
7 2022-08-01 2022-08-01 2022-08-01         99      0.00000        OK-OK-OK
8 2022-08-02 2022-08-02 2022-08-02        100 -19768.28600          $$$$$$
9 2022-08-03 2022-08-03 2022-08-03          0     62.93000              日记

## 从 `.json` 中读取

In [23]:
# 读取
# 因为 ans 列有些为 '...%' 百分数形式，所以也为 String 类型

data  = read_json(r'data\Math23K.json')
cols = allCol(data)

(23162行 ,  5 列)

               列名         数据类型  NaN 个数  NaN 占比
0              id  numpy.int64       0   0.00%
1   original_text          str       0   0.00%
2  segmented_text          str       0   0.00%
3        equation          str       0   0.00%
4             ans          str       0   0.00%

In [24]:
data.iloc[[6]]

,id,original_text,segmented_text,equation,ans
6,7,象山学校原有学生700人，7月份毕业280人，9月份招入新生350人，这时象山学校的学生比原...,象山 学校 原有 学生 700 人 ， 7 月份 毕业 280 人 ， 9 月份 招 入 新...,x=(350-280)/700,10%

# 测试搜索

In [25]:
data  = pd.DataFrame()
data['i'] = list(range(1 , 7 , 1))
data['S'] = ['aba' , 'bAb' , 'cdc' , 'dCd' , 'efe' , 'fFf']
data['L'] = [[1 , 2 , '3'] , [4 , 5 , '6'] , [7 , 8 , '9'] , [1 , 3 , '5'] , [2 , 4 , '6'] , [3 , 5 , '7']]
data.index = ['A' , 'B' , 'C' , 'D' , 'E' , 'F']
cols = allCol(data)
data

( 6 行 ,  3 列)

  列名         数据类型  NaN 个数  NaN 占比
0  i  numpy.int64       0   0.00%
1  S          str       0   0.00%
2  L         list       0   0.00%

   i    S          L
A  1  aba  [1, 2, 3]
B  2  bAb  [4, 5, 6]
C  3  cdc  [7, 8, 9]
D  4  dCd  [1, 3, 5]
E  5  efe  [2, 4, 6]
F  6  fFf  [3, 5, 7]

## 单个 `sub`

In [26]:
# 在 S 列中搜索字符串 'd'

find_sub(data[['i' , 'S']] , 'S' , 'd')

   i    S  exist
C  3  cdc   True
D  4  dCd   True

In [27]:
# 在 L 列中搜索数字 3

find_sub(data[['i' , 'L']] , 'L' , 3)

   i          L  exist
D  4  [1, 3, 5]   True
F  6  [3, 5, 7]   True

In [28]:
# 在 L 列中搜索字符串 '3'

find_sub(data[['i' , 'L']] , 'L' , '3')

   i          L  exist
A  1  [1, 2, 3]   True

## 多个 `subs`

In [29]:
# 在 L 列中搜索数字 1 ，3 和字符串 '3'
# 同时含有多个元素的行会重复，可依据行索引观察到

find_subs(data[['L']] , 'L' , [1 , 3 , '3'])

           L  exist
A  [1, 2, 3]   True
D  [1, 3, 5]   True
D  [1, 3, 5]   True
F  [3, 5, 7]   True
A  [1, 2, 3]   True

In [30]:
# 含有 List 列，仅重置行索引，无法去重

find_subs_nodul(data[['L']] , 'L' , [1 , 3 , '3'])

含有 List 列，无法去重，仅能重置行索引！！！

           L  exist
0  [1, 2, 3]   True
1  [1, 3, 5]   True
2  [1, 3, 5]   True
3  [3, 5, 7]   True
4  [1, 2, 3]   True

In [31]:
# 在 S 列中搜索字符串 'e' , 'f'
# 同时含有多个元素的行会重复，可依据行索引观察到

find_subs(data[['S']] , 'S' , ['e' , 'f'])

     S  exist
E  efe   True
E  efe   True
F  fFf   True

In [32]:
# 不含 List 列，既可以重置行索引，又可以去重

find_subs_nodul(data[['S']] , 'S' , ['e' , 'f'])

     S  exist
0  efe   True
1  fFf   True

# 测试提取

## 目标函数

In [33]:
# 判断字符串是否为数字

for ch in '.0.1.2.3.4.5.6.7.8.9.':
    print(Needed_Num(ch) , end = '  ')

True  True  True  True  True  True  True  True  True  True  True  True  True  True  True  True  True  True  True  True  True

## 数值转换

In [34]:
L = ['33' , '33.199' , '33.299' , '33.399' , '33.499' , '33.500' , '33.600' , '33.700' , '33.800' , '33.900']

In [35]:
trans_flo_all(L)

[33.0, 33.199, 33.299, 33.399, 33.499, 33.5, 33.6, 33.7, 33.8, 33.9]

In [36]:
trans_flo_round(L , 0)

[33.0, 33.0, 33.0, 33.0, 33.0, 34.0, 34.0, 34.0, 34.0, 34.0]

In [37]:
trans_int(trans_flo_all(L))

[33, 33, 33, 33, 33, 33, 33, 33, 33, 33]

In [38]:
trans_int(trans_flo_round(L , 0))

[33, 33, 33, 33, 33, 34, 34, 34, 34, 34]

In [39]:
trans_often(L)

[33, 33, 33, 33, 33, 34, 34, 34, 34, 34]

In [40]:
addListTool([1 , 2 , 3])

6

In [41]:
addListTool([1 , 2 , 3.0])

6.0

In [42]:
addListTool([ ])

0

In [7]:
# 0 & 0.0  -->  None

trans_Y_for_Viz([1 , 0 , 1 , 0.0 , 1 , 0.00000])

[1, None, 1, None, 1, None]

## 提取过程

In [43]:
line = '1.111aA提取Aa，2.222aA提取Aa，aA提取Aa3.333，4.444aA提取Aa5.555，aA提取Aa6.666'

In [44]:
Extract_Needed(line , Needed_Num)

['1.111', '2.222', '3.333', '4.444', '5.555', '6.666']

In [45]:
trans_often(Extract_Needed(line , Needed_Num))

[1, 2, 3, 4, 6, 7]

# 测试标准化

## `min-max`

In [46]:
data = pd.DataFrame({'酒精含量(%)': [50, 60, 40, 80, 100], '苹果酸含量(%)': [2, 1, 1, 3, 2]})
data

   酒精含量(%)  苹果酸含量(%)
0       50         2
1       60         1
2       40         1
3       80         3
4      100         2

In [47]:
# 参数必须得是 DataFrame

standardize_min_max(data[['酒精含量(%)']])

    酒精含量(%)
0  0.166667
1  0.333333
2  0.000000
3  0.666667
4  1.000000

In [48]:
# 参数必须得是 DataFrame

standardize_min_max(data)

    酒精含量(%)  苹果酸含量(%)
0  0.166667       0.5
1  0.333333       0.0
2  0.000000       0.0
3  0.666667       1.0
4  1.000000       0.5

## `z-score`

In [49]:
data = pd.DataFrame({'酒精含量(%)': [50, 60, 40, 80, 100], '苹果酸含量(%)': [2, 1, 1, 3, 2]})
data

   酒精含量(%)  苹果酸含量(%)
0       50         2
1       60         1
2       40         1
3       80         3
4      100         2

In [50]:
# 参数必须得是 DataFrame

standardize_mean_var(data[['酒精含量(%)']])

    酒精含量(%)
0 -0.742781
1 -0.278543
2 -1.207020
3  0.649934
4  1.578410

In [51]:
# 参数必须得是 DataFrame

standardize_mean_var(data)

    酒精含量(%)  苹果酸含量(%)
0 -0.742781  0.267261
1 -0.278543 -1.069045
2 -1.207020 -1.069045
3  0.649934  1.603567
4  1.578410  0.267261

In [52]:
# 均值（0 或与 0 极其接近）
# 方差（1 或与 1 极其接近）

In [53]:
# 总体，有偏

print(standardize_mean_var(data)['酒精含量(%)'].values.var())
print(standardize_mean_var(data)['酒精含量(%)'].values.std())
print(standardize_mean_var(data)['苹果酸含量(%)'].values.var())
print(standardize_mean_var(data)['苹果酸含量(%)'].values.std())
standardize_mean_var(data).mean()

1.0
1.0
1.0
1.0

酒精含量(%)     4.440892e-17
苹果酸含量(%)   -8.881784e-17
dtype: float64

In [54]:
# 样本，无偏

print(standardize_mean_var(data)['酒精含量(%)'].var())
print(standardize_mean_var(data)['酒精含量(%)'].std())
print(standardize_mean_var(data)['苹果酸含量(%)'].var())
print(standardize_mean_var(data)['苹果酸含量(%)'].std())
standardize_mean_var(data).mean()

1.25
1.118033988749895
1.25
1.118033988749895

酒精含量(%)     4.440892e-17
苹果酸含量(%)   -8.881784e-17
dtype: float64

# 测试相似性

## 欧氏距离

In [55]:
data = pd.DataFrame([[5 , 1 , 5] , [4 , 2 , 2] , [4 , 2 , 1]])
data.columns = ['用户1', '用户2', '用户3']
data.index = ['物品A', '物品B', '物品C']
data

     用户1  用户2  用户3
物品A    5    1    5
物品B    4    2    2
物品C    4    2    1

In [56]:
print(similarity_o(data.iloc[0] , data.iloc[1]))
print(similarity_o(data.iloc[1] , data.iloc[0]))
print(similarity_o(data.iloc[0] , data.iloc[2]))
print(similarity_o(data.iloc[1] , data.iloc[2]))

3.3166247903554
3.3166247903554
4.242640687119285
1.0

In [57]:
similarity_o(np.array([5 , 1 , 5]) , np.array([4 , 2 , 2]))

3.3166247903554

In [58]:
similarity_o_all(data)

          物品A       物品B       物品C
物品A  0.000000  3.316625  4.242641
物品B  3.316625  0.000000  1.000000
物品C  4.242641  1.000000  0.000000

In [59]:
similarity_o_all(np.array([[5 , 1 , 5] , [4 , 2 , 2] , [4 , 2 , 1]]))

          vec1      vec2      vec3
vec1  0.000000  3.316625  4.242641
vec2  3.316625  0.000000  1.000000
vec3  4.242641  1.000000  0.000000

## 余弦相似度

In [60]:
data = pd.DataFrame([[5 , 1 , 5] , [4 , 2 , 2] , [4 , 2 , 1]])
data.columns = ['用户1', '用户2', '用户3']
data.index = ['物品A', '物品B', '物品C']
data

     用户1  用户2  用户3
物品A    5    1    5
物品B    4    2    2
物品C    4    2    1

In [61]:
similarity_cos_all(data)

          物品A       物品B       物品C
物品A  1.000000  0.914659  0.825029
物品B  0.914659  1.000000  0.979958
物品C  0.825029  0.979958  1.000000

In [62]:
similarity_cos_all(np.array([[5 , 1 , 5] , [4 , 2 , 2] , [4 , 2 , 1]]))

          vec1      vec2      vec3
vec1  1.000000  0.914659  0.825029
vec2  0.914659  1.000000  0.979958
vec3  0.825029  0.979958  1.000000

## 余弦距离

In [63]:
# 余弦距离 = 1 - 余弦相似度

similarity_cos_dist_all(data)

              物品A       物品B       物品C
物品A  2.220446e-16  0.085341  0.174971
物品B  8.534088e-02  0.000000  0.020042
物品C  1.749714e-01  0.020042  0.000000

In [64]:
# 用 .values 转化为二维 ndarray 可读性更好

similarity_cos_dist_all(data.values)

          vec1      vec2      vec3
vec1  0.000000  0.085341  0.174971
vec2  0.085341  0.000000  0.020042
vec3  0.174971  0.020042  0.000000

In [65]:
# 用二维 ndarray 可读性更好

similarity_cos_dist_all(np.array([[5 , 1 , 5] , [4 , 2 , 2] , [4 , 2 , 1]]))

          vec1      vec2      vec3
vec1  0.000000  0.085341  0.174971
vec2  0.085341  0.000000  0.020042
vec3  0.174971  0.020042  0.000000

## 皮尔逊相关系数一

In [66]:
# 可以传入两个 List

similarity_r([1 , 3 , 5 , 7 , 9] , [9 , 8 , 6 , 4 , 2])

相关系数 r = -0.9938837346736188
显著水平 P = 0.0005736731093322215   （显著相关）

In [67]:
# 可以传入两个 ndarray

similarity_r(np.array([1 , 3 , 5 , 7 , 9]) , np.array([9 , 8 , 6 , 4 , 2]))

相关系数 r = -0.9938837346736188
显著水平 P = 0.0005736731093322215   （显著相关）

In [68]:
# 可以传入 DataFrame 的两行 Series（.iloc[]）

data = pd.DataFrame([[1 , 3 , 5 , 7 , 9] , [9 , 8 , 6 , 4 , 2]])
display(data)
similarity_r(data.iloc[0] , data.iloc[1])

   0  1  2  3  4
0  1  3  5  7  9
1  9  8  6  4  2

相关系数 r = -0.9938837346736188
显著水平 P = 0.0005736731093322215   （显著相关）

## 皮尔逊相关系数二

In [69]:
data = pd.DataFrame([[5 , 1 , 5] , [4 , 2 , 2] , [4 , 2 , 1]])
data.columns = ['用户1', '用户2', '用户3']
data.index = ['物品A', '物品B', '物品C']
data

     用户1  用户2  用户3
物品A    5    1    5
物品B    4    2    2
物品C    4    2    1

In [70]:
similarity_r_one(data , '物品A')

          物品A
物品A  1.000000
物品B  0.500000
物品C  0.188982

In [71]:
similarity_r(data.iloc[0] , data.iloc[1])
similarity_r([5 , 1 , 5] , [4 , 2 , 2])

相关系数 r = 0.5000000000000001
显著水平 P = 0.6666666666666666   （非显著相关）
相关系数 r = 0.5000000000000001
显著水平 P = 0.6666666666666666   （非显著相关）

In [72]:
similarity_r_all(data)

          物品A       物品B       物品C
物品A  1.000000  0.500000  0.188982
物品B  0.500000  1.000000  0.944911
物品C  0.188982  0.944911  1.000000

In [73]:
similarity_r(data.iloc[1] , data.iloc[2])
similarity_r([4 , 2 , 2] , [4 , 2 , 1])

相关系数 r = 0.944911182523068
显著水平 P = 0.21229561500965669   （非显著相关）
相关系数 r = 0.944911182523068
显著水平 P = 0.21229561500965669   （非显著相关）

# 分组
>- `groupby( 参数一 )[ 参数二 ].函数`
>  - 参数一：`['分组列名' , '分组列名' , ...]`
>    - 分组后，参数一的分组列名将作为行索引
>  - 参数二：`['分组后选取列名' , '分组后选取列名' , ...]`
>    - 若参数二使用单层 `[]` ，则函数运算后结果为 Series
>    - 若参数二使用双层 `[[]]` ，则函数运算后结果为 DataFrame
>    - 见下述结果整合
>  - 函数：见下述四种
>- 本质
>  - 按参数一的列依次分组
>  - 然后在每个组内选取参数二的列
>  - 最后对参数二的列在组内进行函数运算

In [74]:
data = pd.DataFrame([
    ['A' , 'a1' , 1 , 5] , 
    ['A' , 'a2' , 2 , 4] , 
    ['A' , 'a2' , 3 , 3] , 
    ['A' , 'a2' , 4 , 2] , 
    ['A' , 'a2' , 5 , 1] , 
    
    ['B' , 'b1' , 11 , 55] , 
    ['B' , 'b1' , 22 , 44] , 
    ['B' , 'b2' , 33 , 33] , 
    ['B' , 'b2' , 44 , 22] , 
    ['B' , 'b2' , 55 , 11] , 
    
    ['C' , 'c1' , 111 , 555] , 
    ['C' , 'c1' , 222 , 444] , 
    ['C' , 'c1' , 333 , 333] , 
    ['C' , 'c2' , 444 , 222] , 
    ['C' , 'c2' , 555 , 111] , 
])
data.columns = ['一', '二', 'n1', 'n2']
data

    一   二   n1   n2
0   A  a1    1    5
1   A  a2    2    4
2   A  a2    3    3
3   A  a2    4    2
4   A  a2    5    1
5   B  b1   11   55
6   B  b1   22   44
7   B  b2   33   33
8   B  b2   44   22
9   B  b2   55   11
10  C  c1  111  555
11  C  c1  222  444
12  C  c1  333  333
13  C  c2  444  222
14  C  c2  555  111

## 单列分组

In [75]:
G1 = data.groupby(['一'])[['n1']]
G1

In [76]:
G2 = data.groupby(['一'])[['n1' , 'n2']]
G2

## 多列分组

In [77]:
G3 = data.groupby(['一' , '二'])[['n1']]
G3

In [78]:
G4 = data.groupby(['一' , '二'])[['n1' , 'n2']]
G4

## 分组后求 `min`

In [79]:
G1.min()

    n1
一
A    1
B   11
C  111

In [80]:
G3.min()

       n1
一 二
A a1    1
  a2    2
B b1   11
  b2   33
C c1  111
  c2  444

## 分组后求 `max`

In [81]:
G2.max()

    n1   n2
一
A    5    5
B   55   55
C  555  555

In [82]:
G4.max()

       n1   n2
一 二
A a1    1    5
  a2    5    4
B b1   22   55
  b2   55   33
C c1  333  555
  c2  555  222

## 分组后求 `cnt`

In [83]:
G1.count()

   n1
一
A   5
B   5
C   5

In [84]:
G4.count()

      n1  n2
一 二
A a1   1   1
  a2   4   4
B b1   2   2
  b2   3   3
C c1   3   3
  c2   2   2

## 分组后求 `mean`

In [85]:
G2.mean()

      n1     n2
一
A    3.0    3.0
B   33.0   33.0
C  333.0  333.0

In [86]:
G3.mean()

         n1
一 二
A a1    1.0
  a2    3.5
B b1   16.5
  b2   44.0
C c1  222.0
  c2  499.5

## 结果整合

In [87]:
G1 = data.groupby(['一'])['n1']
print(type(G1.min()))
G1.min()

<class 'pandas.core.series.Series'>

一
A      1
B     11
C    111
Name: n1, dtype: int64

In [88]:
G2 = data.groupby(['一'])[['n1']]
print(type(G2.mean()))
G2.mean()

<class 'pandas.core.frame.DataFrame'>

      n1
一
A    3.0
B   33.0
C  333.0

In [89]:
# 不管参数二是单层 [] （Series）还是双层 [[]] （DataFrame）
# 函数运算后可以整合到 DataFrame 中

# 不过老生常谈
# 最好的方式还是推荐使用 Series + .values 的形式

res = pd.DataFrame()
res['最小值'] = G1.min()
res['最大值'] = G2.mean()
res

   最小值    最大值
一
A    1    3.0
B   11   33.0
C  111  333.0